brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'ssh-copy-id'
brew 'fortune'
brew 'cowsay'
brew 'fzf'

tap 'homebrew/services'
tap 'caskroom/cask'

# Misc tools
brew 'wget'
brew 'hub'
brew 'ack'
brew 'tree'
brew 'tmux'
brew 'tig'
brew 'ctags'
brew 'httpie'
brew 'the_silver_searcher'
brew 'jq'
brew 'htop'
brew 'neovim/neovim/neovim'
brew 'fzf'
brew 'shellcheck'

# Imaging

# Dev env
brew 'node'
brew 'go'
brew 'erlang'
brew 'elixir'

# Databases


# Add some cask formula too

cask 'macdown', args: { appdir: '/Applications' }
cask 'mojibar', args: { appdir: '/Applications' }
cask 'sequel-pro', args: { appdir: '/Applications' }

# Usefull Ql plugins

cask 'quicklook-json'
cask 'qlmarkdown'
cask 'qlstephen'
