brew 'bash'
brew 'bash-completion'

# Git stuff
brew 'git'
# Make git more fancy for thing like diff
brew 'dandavison/delta'
brew 'diff-so-fancy'
# create PR/issue and so on on the CLI
brew 'hub'
# brow git commits easily
brew 'tig'

brew 'ssh-copy-id'
brew 'fortune'
brew 'cowsay'
brew 'fzf'

# Misc tools
brew 'wget'
brew 'tree'
brew 'tmux'
brew 'ctags'
brew 'httpie'
brew 'ripgrep' # better than [grep,ag,ack]
brew 'fd' # better than find
brew 'jq' # manipulate json with ease
brew 'htop'
brew 'neovim'
brew 'bat' #better cat with syntax highlight
brew 'mike-engel/jwt-cli/jwt-cli'
brew 'z'
brew 'exa' # better than ls
brew 'watch'
brew 'Goles/battery/battery' # show battery status terminal
brew 'knqyf263/pet/pet' # quick ref to usefull cli snippet

# Lint
brew 'hadolint' # Lint Dockerfile
brew 'shellcheck' # Lint bash script

# K8 tools
brew 'kubectx'
brew 'stern'
brew 'farmotive/k8s/kex', args: ["without-kubernetes-cli"]


# Dev env
brew 'node'
brew 'go'
brew 'erlang'
brew 'elixir'
brew 'rbenv'
brew 'ruby-build'

# Databases

brew 'simon-engledew/gocmdpev/gocmdpev'
brew 'pspg' #pager for psql

# Add some cask formula too

cask 'macdown', args: { appdir: '/Applications' }
cask 'cleanshot', args: { appdir: '/Applications' } #screen capture tool
cask 'postico', args: { appdir: '/Applications' } #Postgres UI db admin/view
cask 'tad', args: { appdir: '/Applications' } #csv viewer
cask 'sequel-pro', args: { appdir: '/Applications' }
cask 'spectacle', args: { appdir: '/Applications' }
cask 'flux', args: { appdir: '/Applications' }
cask 'slack', args: { appdir: '/Applications' }
cask 'karabiner-elements', args: { appdir: '/Applications' }

# Usefull QuickLook plugins

cask 'quicklook-json'
cask 'qlmarkdown'
cask 'qlstephen'
