tap 'neovim/neovim'

brew 'bash'
brew 'bash-completion'
brew 'git'
brew 'hub'
brew 'ssh-copy-id'
brew 'fortune'
brew 'cowsay'
brew 'fzf'

# Misc tools
brew 'wget'
brew 'tree'
brew 'tmux'
brew 'tig'
brew 'ctags'
brew 'httpie'
brew 'ripgrep'
brew 'jq'
brew 'jid' #incremental json filter
brew 'htop'
brew 'neovim/neovim/neovim'
brew 'shellcheck'
brew 'stern'
brew 'knqyf263/pet/pet'
brew 'mike-engel/jwt-cli/jwt-cli'
brew 'kubectx'
brew 'z'
brew 'exa'
brew 'watch'
brew 'diff-so-fancy'
brew 'tavianator/tap/bfs' #better find


# Imaging

# Dev env
brew 'node'
brew 'go'
brew 'erlang'
brew 'elixir'
brew 'rbenv'
brew 'ruby-build'

# Databases


# Add some cask formula too

cask 'macdown', args: { appdir: '/Applications' }
cask 'mojibar', args: { appdir: '/Applications' }
cask 'sequel-pro', args: { appdir: '/Applications' }
cask 'spectacle', args: { appdir: '/Applications' }
cask 'pg-commander', args: { appdir: '/Applications' }
cask 'medis', args: { appdir: '/Applications' }
cask 'flux', args: { appdir: '/Applications' }
cask 'atom', args: { appdir: '/Applications' }
cask 'visual-studio-code', args: { appdir: '/Applications' }
cask 'slack', args: { appdir: '/Applications' }

# Usefull Ql plugins

cask 'quicklook-json'
cask 'qlmarkdown'
cask 'qlstephen'
